#### here we are predicting that a person is going to pay loan repayment or not

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
from sklearn.model_selection import train_test_split
from sklearn.tree import DecisionTreeClassifier
from sklearn import tree
from sklearn.metrics import accuracy_score

In [2]:
dataset = pd.read_csv('train.csv')
dataset.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,3.0,0.0,"O'Donoghue, Ms. Bridget",female,NaN,0.0,0.0,364856,7.750,NaN,Q,NaN,NaN,NaN
1,2.0,0.0,"Morley, Mr. Henry Samuel (""Mr Henry Marshall"")",male,39.0,0.0,0.0,250655,26.000,NaN,S,NaN,NaN,NaN
2,2.0,1.0,"Smith, Miss. Marion Elsie",female,40.0,0.0,0.0,31418,13.000,NaN,S,9,NaN,NaN
3,3.0,1.0,"Goldsmith, Mrs. Frank John (Emily Alice Brown)",female,31.0,1.0,1.0,363291,20.525,NaN,S,C D,NaN,"Strood, Kent, England Detroit, MI"
4,3.0,1.0,"McCoy, Miss. Agnes",female,NaN,2.0,0.0,367226,23.250,NaN,Q,16,NaN,NaN

In [3]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1009 entries, 0 to 1008
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   pclass     1009 non-null   float64
 1   survived   1009 non-null   float64
 2   name       1009 non-null   object
 3   sex        1009 non-null   object
 4   age        812 non-null    float64
 5   sibsp      1009 non-null   float64
 6   parch      1009 non-null   float64
 7   ticket     1009 non-null   object
 8   fare       1008 non-null   float64
 9   cabin      229 non-null    object
 10  embarked   1008 non-null   object
 11  boat       374 non-null    object
 12  body       98 non-null     float64
 13  home.dest  582 non-null    object
dtypes: float64(7), object(7)
memory usage: 110.5+ KB

In [4]:
dataset.shape

(1009, 14)

In [5]:
dataset.isnull().sum()

pclass         0
survived       0
name           0
sex            0
age          197
sibsp          0
parch          0
ticket         0
fare           1
cabin        780
embarked       1
boat         635
body         911
home.dest    427
dtype: int64

In [7]:
dataset.drop('cabin',axis=1,inplace=True)

In [8]:
dataset.isnull().sum()

pclass         0
survived       0
name           0
sex            0
age          197
sibsp          0
parch          0
ticket         0
fare           1
embarked       1
boat         635
body         911
home.dest    427
dtype: int64

In [9]:
dataset.drop('body',axis=1,inplace=True)

In [10]:
dataset.isnull().sum()

pclass         0
survived       0
name           0
sex            0
age          197
sibsp          0
parch          0
ticket         0
fare           1
embarked       1
boat         635
home.dest    427
dtype: int64

In [11]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1009 entries, 0 to 1008
Data columns (total 12 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   pclass     1009 non-null   float64
 1   survived   1009 non-null   float64
 2   name       1009 non-null   object
 3   sex        1009 non-null   object
 4   age        812 non-null    float64
 5   sibsp      1009 non-null   float64
 6   parch      1009 non-null   float64
 7   ticket     1009 non-null   object
 8   fare       1008 non-null   float64
 9   embarked   1008 non-null   object
 10  boat       374 non-null    object
 11  home.dest  582 non-null    object
dtypes: float64(6), object(6)
memory usage: 94.7+ KB

In [12]:
dataset.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,embarked,boat,home.dest
0,3.0,0.0,"O'Donoghue, Ms. Bridget",female,NaN,0.0,0.0,364856,7.750,Q,NaN,NaN
1,2.0,0.0,"Morley, Mr. Henry Samuel (""Mr Henry Marshall"")",male,39.0,0.0,0.0,250655,26.000,S,NaN,NaN
2,2.0,1.0,"Smith, Miss. Marion Elsie",female,40.0,0.0,0.0,31418,13.000,S,9,NaN
3,3.0,1.0,"Goldsmith, Mrs. Frank John (Emily Alice Brown)",female,31.0,1.0,1.0,363291,20.525,S,C D,"Strood, Kent, England Detroit, MI"
4,3.0,1.0,"McCoy, Miss. Agnes",female,NaN,2.0,0.0,367226,23.250,Q,16,NaN

In [15]:
dataset.isnull().sum()

pclass         0
survived       0
sex            0
age          197
sibsp          0
parch          0
ticket         0
fare           1
embarked       1
boat         635
home.dest    427
dtype: int64

In [17]:
dataset.drop(['ticket','boat','home.dest'],axis = 1 , inplace=True)

In [18]:
dataset.isnull().sum()

pclass        0
survived      0
sex           0
age         197
sibsp         0
parch         0
fare          1
embarked      1
dtype: int64

In [21]:
mean_age = dataset['age'].mean()
mean_age

29.838977832512317

In [22]:
mean_age = 29

In [25]:
## converting and removing the string  values
sex = pd.get_dummies(dataset['sex'], drop_first =True)
 ## since we get two col but we required only one col and use shortcut shift+tab
sex.head()

   male
0     0
1     1
2     0
3     0
4     0

In [27]:
embark = pd.get_dummies(dataset['embarked'],drop_first = True)
embark.head()

   Q  S
0  1  0
1  0  1
2  0  1
3  0  1
4  1  0

In [30]:
Pclass = pd.get_dummies(dataset['pclass'],drop_first = True)
Pclass.head()

   2.0  3.0
0    0    1
1    1    0
2    1    0
3    0    1
4    0    1

In [31]:
dataset = pd.concat([dataset,sex,embark,Pclass],axis=1)
dataset.head()         ## col male , Q,S,2,3 concatenates

,pclass,survived,sex,age,sibsp,parch,fare,embarked,male,Q,S,2.0,3.0
0,3.0,0.0,female,NaN,0.0,0.0,7.750,Q,0,1,0,0,1
1,2.0,0.0,male,39.0,0.0,0.0,26.000,S,1,0,1,1,0
2,2.0,1.0,female,40.0,0.0,0.0,13.000,S,0,0,1,1,0
3,3.0,1.0,female,31.0,1.0,1.0,20.525,S,0,0,1,0,1
4,3.0,1.0,female,NaN,2.0,0.0,23.250,Q,0,1,0,0,1

In [32]:
dataset.isnull().sum()

pclass        0
survived      0
sex           0
age         197
sibsp         0
parch         0
fare          1
embarked      1
male          0
Q             0
S             0
2.0           0
3.0           0
dtype: int64

In [33]:
dataset.drop(['sex','embarked','pclass'],axis = 1 , inplace=True)
dataset.head()

   survived   age  sibsp  parch    fare  male  Q  S  2.0  3.0
0       0.0   NaN    0.0    0.0   7.750     0  1  0    0    1
1       0.0  39.0    0.0    0.0  26.000     1  0  1    1    0
2       1.0  40.0    0.0    0.0  13.000     0  0  1    1    0
3       1.0  31.0    1.0    1.0  20.525     0  0  1    0    1
4       1.0   NaN    2.0    0.0  23.250     0  1  0    0    1

In [36]:
dataset.iloc[:,1] = dataset.iloc[:,1].replace(np.NaN ,29)
dataset.head()

   survived   age  sibsp  parch    fare  male  Q  S  2.0  3.0
0       0.0  29.0    0.0    0.0   7.750     0  1  0    0    1
1       0.0  39.0    0.0    0.0  26.000     1  0  1    1    0
2       1.0  40.0    0.0    0.0  13.000     0  0  1    1    0
3       1.0  31.0    1.0    1.0  20.525     0  0  1    0    1
4       1.0  29.0    2.0    0.0  23.250     0  1  0    0    1

In [48]:
dataset.isnull().sum()

survived    0
age         0
sibsp       0
parch       0
fare        1
male        0
Q           0
S           0
2.0         0
3.0         0
dtype: int64

In [49]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1009 entries, 0 to 1008
Data columns (total 10 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   survived  1009 non-null   float64
 1   age       1009 non-null   float64
 2   sibsp     1009 non-null   float64
 3   parch     1009 non-null   float64
 4   fare      1008 non-null   float64
 5   male      1009 non-null   uint8
 6   Q         1009 non-null   uint8
 7   S         1009 non-null   uint8
 8   2.0       1009 non-null   uint8
 9   3.0       1009 non-null   uint8
dtypes: float64(5), uint8(5)
memory usage: 44.5 KB

In [51]:
dataset.iloc[:,4] = dataset.iloc[:,4].replace(np.NaN,23.25)

In [52]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1009 entries, 0 to 1008
Data columns (total 10 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   survived  1009 non-null   float64
 1   age       1009 non-null   float64
 2   sibsp     1009 non-null   float64
 3   parch     1009 non-null   float64
 4   fare      1009 non-null   float64
 5   male      1009 non-null   uint8
 6   Q         1009 non-null   uint8
 7   S         1009 non-null   uint8
 8   2.0       1009 non-null   uint8
 9   3.0       1009 non-null   uint8
dtypes: float64(5), uint8(5)
memory usage: 44.5 KB

### training the model

In [53]:
y = dataset['survived']
X = dataset.drop('survived',axis=1)

In [54]:
X.shape

(1009, 9)

In [55]:
y.shape

(1009,)

In [42]:
train_test_split?

In [56]:
X_train, X_test, y_train, y_test = train_test_split( X, y, test_size=0.33, random_state=100)


decision_classifier_tree = DecisionTreeClassifier()
## clf_entropy = DecisionTreeClassifier(criterion = "entropy", random_state = 100, max_depth=3, min_samples_leaf=5)

In [57]:
decision_classifier_tree.fit(X_train,y_train)

C:\Users\Subhajit ghosh\lib\site-packages\sklearn\utils\validation.py:1675: FutureWarning: Feature names only support names that are all strings. Got feature names with dtypes: ['float', 'str']. An error will be raised in 1.2.
  warnings.warn(

DecisionTreeClassifier()

In [58]:
ypred = decision_classifier_tree.predict(X_test)
ypred

C:\Users\Subhajit ghosh\lib\site-packages\sklearn\utils\validation.py:1675: FutureWarning: Feature names only support names that are all strings. Got feature names with dtypes: ['float', 'str']. An error will be raised in 1.2.
  warnings.warn(

array([0., 1., 0., 0., 0., 0., 0., 0., 1., 0., 1., 0., 0., 0., 0., 0., 0.,
       0., 0., 0., 0., 1., 0., 0., 0., 0., 1., 1., 1., 0., 1., 0., 0., 0.,
       1., 0., 0., 0., 0., 0., 1., 0., 0., 0., 0., 0., 0., 1., 0., 0., 0.,
       0., 1., 0., 1., 1., 1., 0., 1., 0., 1., 1., 0., 0., 1., 0., 1., 1.,
       0., 0., 1., 0., 1., 1., 0., 0., 0., 0., 0., 1., 1., 0., 0., 1., 0.,
       0., 1., 1., 0., 0., 0., 0., 0., 0., 0., 0., 1., 0., 1., 0., 0., 0.,
       0., 0., 0., 0., 0., 1., 1., 1., 0., 0., 0., 1., 0., 0., 0., 0., 1.,
       0., 0., 0., 0., 1., 1., 1., 0., 0., 0., 0., 0., 0., 1., 0., 0., 0.,
       0., 1., 0., 1., 1., 1., 0., 0., 1., 0., 0., 1., 0., 0., 1., 1., 1.,
       0., 0., 1., 0., 1., 0., 1., 1., 0., 1., 0., 1., 0., 1., 0., 0., 1.,
       1., 0., 1., 1., 0., 0., 0., 0., 0., 0., 0., 1., 0., 0., 0., 0., 1.,
       0., 0., 1., 0., 1., 1., 1., 1., 0., 0., 1., 0., 0., 0., 0., 0., 0.,
       0., 0., 0., 0., 1., 0., 0., 1., 1., 0., 0., 0., 0., 1., 0., 0., 0.,
       1., 0., 0., 0., 0., 0., 1., 0., 0., 0., 0., 0., 0., 0., 1., 0., 0.,
       0., 0., 1., 0., 0., 0., 0., 1., 0., 0., 0., 0., 0., 0., 0., 1., 0.,
       1., 0., 1., 0., 1., 0., 1., 0., 0., 0., 1., 0., 0., 1., 1., 1., 0.,
       1., 0., 0., 1., 1., 0., 1., 0., 0., 0., 1., 1., 0., 0., 1., 1., 1.,
       1., 0., 0., 1., 1., 0., 0., 0., 1., 0., 1., 1., 1., 0., 0., 0., 1.,
       1., 1., 0., 0., 1., 0., 0., 0., 0., 0., 1., 0., 0., 0., 1., 0., 0.,
       0., 0., 1., 0., 0., 1., 0., 1., 0., 0.])

In [59]:
output = accuracy_score(y_test,ypred)
output

0.7537537537537538